---
kind: type
id: T:Autodesk.Revit.DB.EditScope
source: html/bac11282-3a3b-953e-8bc4-960c62da4946.htm
---
# Autodesk.Revit.DB.EditScope

The base class for a scope object that provides special access and limitations related to editing certain elements.

## Syntax (C#)
```csharp
public class EditScope : IDisposable
```

## Remarks
Derivations of this class provide specific functionality to manage edit modes for specific purposes.